names = [ 
    "Алексей", "Мария", "Иван", "Анна", "Дмитрий", "Ольга", "Сергей", "Елена", "Артем", "Татьяна","Елена", 
    "Алексей", "Мария", "Иван", "Анна", "Дмитрий", "Ольга", "Сергей", "Елена", "Артем", "Татьяна","Елена", 
    "Алексей", "Мария", "Иван", "Анна", "Дмитрий", "Ольга", "Сергей", "Елена", "Артем", "Татьяна","Елена" 
    # ... и так далее — повторяешь блок, пока не наберётся 300 имён 
] 
html = 0 
for i in names: 
    if i == "Елена": 
        html += 1 
print(html) 
if "Анна" in names: 
    print("Is here") 